---
title: SystemsFailures
classe: Autodesk.Revit.DB.BuiltInFailures+SystemsFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# SystemsFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AddingOtherConnectedMembersToSystem { get; }` | `SystemsFailures.AddingOtherConnectedMembersToSystem` | FailureDefinitionId |
| `FailureDefinitionId CircuitWorksetClosedWarning { get; }` | `SystemsFailures.CircuitWorksetClosedWarning` | FailureDefinitionId |
| `FailureDefinitionId CreatePartsWithInvalidService { get; }` | `SystemsFailures.CreatePartsWithInvalidService` | FailureDefinitionId |
| `FailureDefinitionId CreatePartsWithInvalidSystem { get; }` | `SystemsFailures.CreatePartsWithInvalidSystem` | FailureDefinitionId |
| `FailureDefinitionId CreatePartsWithoutDabasebase { get; }` | `SystemsFailures.CreatePartsWithoutDabasebase` | FailureDefinitionId |
| `FailureDefinitionId DefaultSystemOver50Elems { get; }` | `SystemsFailures.DefaultSystemOver50Elems` | FailureDefinitionId |
| `FailureDefinitionId ElementsBelongToOtherSystem { get; }` | `SystemsFailures.ElementsBelongToOtherSystem` | FailureDefinitionId |
| `FailureDefinitionId FamilyDoesntMatchSystemProperties { get; }` | `SystemsFailures.FamilyDoesntMatchSystemProperties` | FailureDefinitionId |
| `FailureDefinitionId FamilyDoesntMatchSystemPropertiesWasDisconnected { get; }` | `SystemsFailures.FamilyDoesntMatchSystemPropertiesWasDisconnected` | FailureDefinitionId |
| `FailureDefinitionId MismatchSystemType { get; }` | `SystemsFailures.MismatchSystemType` | FailureDefinitionId |
| `FailureDefinitionId PastePartsWithInvalidService { get; }` | `SystemsFailures.PastePartsWithInvalidService` | FailureDefinitionId |
| `FailureDefinitionId SelectedElementsArePartOfOtherSystem { get; }` | `SystemsFailures.SelectedElementsArePartOfOtherSystem` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```